; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city10)
	(fuel-level plane1 fl3)
	(at plane2 city19)
	(fuel-level plane2 fl0)
	(at plane3 city6)
	(fuel-level plane3 fl3)
	(at plane4 city18)
	(fuel-level plane4 fl4)
	(at plane5 city16)
	(fuel-level plane5 fl5)
	(at plane6 city2)
	(fuel-level plane6 fl5)
	(at plane7 city8)
	(fuel-level plane7 fl3)
	(at person1 city4)
	(at person2 city14)
	(at person3 city12)
	(at person4 city14)
	(at person5 city4)
	(at person6 city12)
	(at person7 city16)
	(at person8 city4)
	(at person9 city1)
	(at person10 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city15)
	(at person1 city17)
	(at person2 city5)
	(at person4 city22)
	(at person5 city6)
	(at person6 city6)
	(at person7 city8)
	(at person9 city3)
	(at person10 city2)
	))

)

; plan
1. (board person7 plane5 city16)
   deleted: (at person7 city16)
   added: (in person7 plane5)
   goals met: 0 of 9
2. (zoom plane5 city16 city8 fl5 fl4 fl3)
   deleted: (at plane5 city16) (fuel-level plane5 fl5)
   added: (at plane5 city8) (fuel-level plane5 fl3)
   goals met: 0 of 9
3. (debark person7 plane5 city8)
   deleted: (in person7 plane5)
   added: (at person7 city8)
   goals met: 1 of 9
4. (zoom plane3 city6 city1 fl3 fl2 fl1)
   deleted: (at plane3 city6) (fuel-level plane3 fl3)
   added: (at plane3 city1) (fuel-level plane3 fl1)
   goals met: 1 of 9
5. (board person9 plane3 city1)
   deleted: (at person9 city1)
   added: (in person9 plane3)
   goals met: 1 of 9
6. (fly plane3 city1 city15 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city15) (fuel-level plane3 fl0)
   goals met: 2 of 9
7. (refuel plane3 city15 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 2 of 9
8. (zoom plane1 city10 city12 fl3 fl2 fl1)
   deleted: (at plane1 city10) (fuel-level plane1 fl3)
   added: (at plane1 city12) (fuel-level plane1 fl1)
   goals met: 2 of 9
9. (board person6 plane1 city12)
   deleted: (at person6 city12)
   added: (in person6 plane1)
   goals met: 2 of 9
10. (fly plane1 city12 city6 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 2 of 9
11. (debark person6 plane1 city6)
   deleted: (in person6 plane1)
   added: (at person6 city6)
   goals met: 3 of 9
12. (fly plane3 city15 city3 fl1 fl0)
   deleted: (at plane3 city15) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 2 of 9
13. (zoom plane4 city18 city14 fl4 fl3 fl2)
   deleted: (at plane4 city18) (fuel-level plane4 fl4)
   added: (at plane4 city14) (fuel-level plane4 fl2)
   goals met: 2 of 9
14. (board person4 plane4 city14)
   deleted: (at person4 city14)
   added: (in person4 plane4)
   goals met: 2 of 9
15. (board person2 plane4 city14)
   deleted: (at person2 city14)
   added: (in person2 plane4)
   goals met: 2 of 9
16. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 2 of 9
17. (debark person9 plane3 city3)
   deleted: (in person9 plane3)
   added: (at person9 city3)
   goals met: 3 of 9
18. (fly plane3 city3 city15 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city15) (fuel-level plane3 fl0)
   goals met: 4 of 9
19. (zoom plane4 city14 city22 fl2 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl2)
   added: (at plane4 city22) (fuel-level plane4 fl0)
   goals met: 4 of 9
20. (zoom plane5 city8 city4 fl3 fl2 fl1)
   deleted: (at plane5 city8) (fuel-level plane5 fl3)
   added: (at plane5 city4) (fuel-level plane5 fl1)
   goals met: 4 of 9
21. (board person5 plane5 city4)
   deleted: (at person5 city4)
   added: (in person5 plane5)
   goals met: 4 of 9
22. (board person10 plane5 city4)
   deleted: (at person10 city4)
   added: (in person10 plane5)
   goals met: 4 of 9
23. (board person1 plane5 city4)
   deleted: (at person1 city4)
   added: (in person1 plane5)
   goals met: 4 of 9
24. (refuel plane4 city22 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 4 of 9
25. (debark person4 plane4 city22)
   deleted: (in person4 plane4)
   added: (at person4 city22)
   goals met: 5 of 9
26. (fly plane4 city22 city5 fl1 fl0)
   deleted: (at plane4 city22) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 5 of 9
27. (debark person2 plane4 city5)
   deleted: (in person2 plane4)
   added: (at person2 city5)
   goals met: 6 of 9
28. (fly plane5 city4 city17 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city17) (fuel-level plane5 fl0)
   goals met: 6 of 9
29. (refuel plane5 city17 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 6 of 9
30. (debark person1 plane5 city17)
   deleted: (in person1 plane5)
   added: (at person1 city17)
   goals met: 7 of 9
31. (fly plane5 city17 city2 fl1 fl0)
   deleted: (at plane5 city17) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 7 of 9
32. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 7 of 9
33. (debark person10 plane5 city2)
   deleted: (in person10 plane5)
   added: (at person10 city2)
   goals met: 8 of 9
34. (fly plane5 city2 city6 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city6) (fuel-level plane5 fl0)
   goals met: 8 of 9
35. (debark person5 plane5 city6)
   deleted: (in person5 plane5)
   added: (at person5 city6)
   goals met: 9 of 9
